Chaitra-bhat/baremetalSTM32DISC1/DRIVERS_STM32F407VG/WORKSPACE/spi_drivers_interrupt/drivers/Inc/spi.h
/*
 * spi.h
 *
 *  Created on: Dec 27, 2021
 *      Author: Navjeevan
 */

#ifndef INC_SPI_H_
#define INC_SPI_H_

#include<stm32f4xx_driver.h>

typedef struct{
	__vo uint32_t SPI_DEVICEMODE;
	__vo uint32_t SPI_BusConfig;
	__vo uint32_t SPI_SclkSpeed;
	__vo uint32_t SPI_DFF;
	__vo uint32_t SPI_CPOL;
	__vo uint32_t SPI_CPHA;
	__vo uint32_t SPI_SSM;
}SPI_Config_t;


typedef struct{
	SPI_RegDef_t *pSPIx;
	SPI_Config_t SPIConfig;
	uint8_t *pTxBuffer;
	uint8_t *pRxBuffer;
	uint32_t TxLen;
	uint32_t RxLen;
	uint8_t TxState;
	uint8_t RxState;
}SPI_Handle_t;

#define SPI_DEVICEMODE_MASTER				1
#define SPI_DEVICEMODE_SLAVE				0

#define SPI_BUSCONFIG_FULLDUPLEX			1
#define SPI_BUSCONFIG_HALFDUPLEX			2
#define SPI_BUSCONFIG_SIMPLEX_TXONLY		3
#define SPI_BUSCONFIG_SIMPLEX_RXONLY		4

#define SPI_BAUDRATE_DIV2					0
#define SPI_BAUDRATE_DIV4					1
#define SPI_BAUDRATE_DIV8					2
#define SPI_BAUDRATE_DIV16					3
#define SPI_BAUDRATE_DIV32					4
#define SPI_BAUDRATE_DIV64					5
#define SPI_BAUDRATE_DIV128					6
#define SPI_BAUDRATE_DIV256					7


#define SPI_DFF_8BITS						0
#define SPI_DFF_16BITS						1

#define SPI_CPOL_HIGH						1
#define SPI_CPOL_LOW						0

#define SPI_CPHA_HIGH						1
#define SPI_CPHA_LOW						0

#define SPI_SSM_ENABLE						1
#define SPI_SSM_DISBALED					0

#define SPI_TXE_FLAG						(1<<1)
#define SPI_RXNE_FLAG						(1<<0)


#define SPI_READY							0
#define SPI_BUSY_IN_RX						1
#define SPI_BUSY_IN_TX						2

// Function prototypes
void SPI_PeriClkEnable(SPI_RegDef_t *pSPIx, uint8_t EnaOrDis);


//Init and deinit prototype
void SPI_Init(SPI_Handle_t *pSPIHandle);
void SPI_DeInit(SPI_Handle_t *pSPIHandle);


// other function prototypes
void SPI_SendData(SPI_RegDef_t *pSPIx, uint8_t *pTxBuffer, uint32_t length);
void SPI_ReceiveData(SPI_RegDef_t *pSPIx, uint8_t *pRxBuffer, uint32_t length);

//Interrupt based function prototypes
uint8_t SPI_SendDataIT(SPI_Handle_t *pSPIHandle, uint8_t *pTxBuffer, uint32_t length);
uint8_t SPI_ReceiveDataIT(SPI_Handle_t *pSPIHandle, uint8_t *pRxBuffer, uint32_t length);

void SPI_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnaOrDis);
void SPI_IRQHandler(SPI_Handle_t *pSPIHandle);
void SPI_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQpriority);

uint8_t SPI_GetFlagStatus(SPI_RegDef_t *pSPIx, uint32_t Flagname);
void SPI_PeripheralEnable(SPI_RegDef_t *pSPIx, uint8_t EnaOrDis);
void SPI_SSIConfig(SPI_RegDef_t *pSPIx, uint8_t EnaOrDis);
#endif /* INC_SPI_H_ */
